bfStep/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       4070;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       4080;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          110;
        startFace       4100;
    }
    stepWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       4210;
    }
    baseWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       4230;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4200;
        startFace       4330;
    }
)

// ************************************************************************* //
