bfStep/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall   
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    stepWall   
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    baseWall      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet      
    {
        type            fixedValue;
        value           uniform (0.177 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
