bfStep/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.6;

boundaryField
{
    topWall 
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1.6;
    }

    stepWall  
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1.6;
    }

    baseWall 
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1.6;
    }
    /*
    inlet
    {
        type            fixedValue;
        value           uniform 1.6;
	}*/

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
	    mixingLength    0.01;
        value           uniform 1.6;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
