bfStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG; // PCG
        preconditioner  DIC;
        smoother        GaussSeidel;
        tolerance       1.0e-07; // 1.0e-04
        relTol          0.01; // 0.05
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels     1;
        minIter         3;
    }

    /*
    Phi
    {
        $p;
    }
    */

    "(U|k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.0; // 0.01
        minIter         3;
        nSweeps         1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    //consistent yes;
    
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|epsilon)"   1e-4;  // change to omega
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
    }

    equations
    {
        U           0.7;
        k           0.7;
        epsilon     0.7; // omega 0.7
    }
}


// ************************************************************************* //
